TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  ASYNC_TCP_CONSOLE("%u host %s, port: %u", this, host, port);

  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  err_t err;
  {
    tcp_core_guard tcg;
    err = dns_gethostbyname(host, &addr, (dns_found_callback)&_tcp_dns_found, this);
  }

  if (err == ERR_OK) {
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV6
    if (addr.type == IPADDR_TYPE_V6) {
      return connect(IPv6Address(addr.u_addr.ip6.addr), port);
    }
    return connect(IPAddress(addr.u_addr.ip4.addr), port);
#else
    return connect(IPAddress(addr.addr), port);
#endif
#else
    return connect(addr, port);
#endif
  } else if (err == ERR_INPROGRESS) {
    _connect_port = port;
    return true;
  }
  log_d("error: %d", err);
  return false;
}

/**
 * _close(), _tcp_close(),  _free_closed_slot() --> onDisconnect() --> ~AsyncClient()
*/
void AsyncClient::close(bool now) {
  if (!_is_pcb_slot_valid(_closed_slot, _pcb)) {
    return;
  }

  if (now) {
    if (_pcb) {
      ASYNC_TCP_CONSOLE("%u", this);
      _tcp_recved(_pcb, _closed_slot, _rx_ack_len);
    }
    _close();
  } else {
    asynctcp_callback([](void *arg) {
      AsyncClient *client = (AsyncClient *)arg;
      if (client->_pcb) {
        ASYNC_TCP_CONSOLE("%u", client);
        _tcp_recved(client->_pcb, client->_closed_slot, client->_rx_ack_len);
      }
      client->_close();
    }, this);
  }
}

/**
 * _tcp_abort() --> tcp_error(), _free_closed_slot() --> _error() -->onDisconnect() --> ~AsyncClient()
*/
err_t AsyncClient::abort() {
  if (!_is_pcb_slot_valid(_closed_slot, _pcb)) {
    return ERR_ABRT;
  }

  asynctcp_callback([](void *arg) {
    AsyncClient *client = (AsyncClient *)arg;
    if (client->_pcb) {
      ASYNC_TCP_CONSOLE("%u", client);
      _tcp_abort(client->_pcb, client->_closed_slot);
      client->_pcb = NULL;
    }
  }, this);
  return ERR_ABRT;
}

size_t AsyncClient::space() const {
  if ((_pcb != NULL) && (_pcb->state == ESTABLISHED)) {
    return tcp_sndbuf(_pcb);
  }
  return 0;
}

size_t AsyncClient::add(const char *data, size_t size, uint8_t apiflags) {
  if (!_pcb || size == 0 || data == NULL) {
    return 0;
  }
  size_t room = space();
  if (!room) {
    return 0;
  }
  size_t will_send = (room < size) ? room : size;
  err_t err = ERR_OK;
  err = _tcp_write(_pcb, _closed_slot, data, will_send, apiflags);
  if (err != ERR_OK) {
    return 0;
  }
  return will_send;
}

bool AsyncClient::send() {
  auto backup = _tx_last_packet;
  _tx_last_packet = millis();
  if (_tcp_output(_pcb, _closed_slot) == ERR_OK) {
    return true;
  }
  _tx_last_packet = backup;
  return false;
}

size_t AsyncClient::ack(size_t len) {
  if (len > _rx_ack_len) {
    len = _rx_ack_len;
  }
  if (len) {
    _tcp_recved(_pcb, _closed_slot, len);
  }
  _rx_ack_len -= len;
  return len;
}

void AsyncClient::ackPacket(struct pbuf *pb) {
  if (!pb) {
    return;
  }
  _tcp_recved(_pcb, _closed_slot, pb->len);
  pbuf_free(pb);
}

/*
 * Main Private Methods
 * */

err_t AsyncClient::_close() {
  // ets_printf("X: 0x%08x\n", (uint32_t)this);
  err_t err = ERR_OK;
  if (_pcb) {
    _tcp_close(_pcb, _closed_slot, this);
    _free_closed_slot();
    _pcb = NULL;
    if (_discard_cb) {
      ASYNC_TCP_CONSOLE("%u: disconnect", this);
      _discard_cb(_discard_cb_arg, this);
    }
  }
  return err;
}

bool AsyncClient::_allocate_closed_slot() {
  bool allocated = false;
  if (xSemaphoreTake(_slots_lock, portMAX_DELAY) == pdTRUE) {
    uint32_t closed_slot_min_index = 0;
    allocated = _closed_slot != INVALID_CLOSED_SLOT;
    if (!allocated) {
      for (int i = 0; i < _number_of_closed_slots; ++i) {
        if ((_closed_slot == INVALID_CLOSED_SLOT || _closed_slots[i] <= closed_slot_min_index) && _closed_slots[i] != 0) {
          closed_slot_min_index = _closed_slots[i];
          _closed_slot = i;
        }
      }
      allocated = _closed_slot != INVALID_CLOSED_SLOT;
    }
    if (allocated) {
      ASYNC_TCP_CONSOLE("%u: _closed_slot = %d, _closed_index = %u, ", this, _closed_slot, _closed_index);
      _closed_slots[_closed_slot] = 0;
      _pcb_slots[_closed_slot] = _pcb;
    }
    xSemaphoreGive(_slots_lock);
  }
  return allocated;
}

void AsyncClient::_free_closed_slot() {
  xSemaphoreTake(_slots_lock, portMAX_DELAY);
  if (_closed_slot != INVALID_CLOSED_SLOT) {
    ASYNC_TCP_CONSOLE("%u: _closed_slot = %d, _closed_index = %u, ", this, _closed_slot, _closed_index);
    _closed_slots[_closed_slot] = _closed_index;
    _pcb_slots[_closed_slot] = nullptr;
    _closed_slot = INVALID_CLOSED_SLOT;
    ++_closed_index;
    if (0 == _closed_index) {
      ++_closed_index;
    }
  }
  xSemaphoreGive(_slots_lock);
}

bool AsyncClient::valid() {
  return _is_pcb_slot_valid(_closed_slot, _pcb);
}

/*
 * Private Callbacks
 * */

/**
 * This callback for http client
 * a callback when client connected to host successful
 * bool AsyncClient::connect(ip_addr_t addr, uint16_t port)
*/
err_t AsyncClient::_connected(tcp_pcb *pcb, err_t err) {
  ASYNC_TCP_CONSOLE("%u", this);
  if (_pcb) {
    _rx_last_packet = millis();
  }
  _tx_last_packet = 0;
  _rx_last_ack = 0;
  if (_connect_cb) {
    _connect_cb(_connect_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_error(err_t err) {
  if (_error_cb) {
    _error_cb(_error_cb_arg, this, err);
  }
  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
  }
}

// In LwIP Thread
err_t AsyncClient::_lwip_fin(tcp_pcb *pcb, err_t err) {
  if (!_pcb || pcb != _pcb) {
    log_d("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }
  ASYNC_TCP_CONSOLE("%u", this);
  _reset_tcp_callbacks(_pcb, this);
  if (tcp_close(_pcb) != ERR_OK) {
    tcp_abort(_pcb);
  }
  _free_closed_slot();
  _pcb = NULL;
  return ERR_OK;
}

// In Async Thread
err_t AsyncClient::_fin(tcp_pcb *pcb, err_t err) {
  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
  }
  return ERR_OK;
}

err_t AsyncClient::_sent(tcp_pcb *pcb, uint16_t len) {
  _rx_last_ack = _rx_last_packet = millis();
  if (_sent_cb) {
    _sent_cb(_sent_cb_arg, this, len, (_rx_last_packet - _tx_last_packet));
  }
  return ERR_OK;
}

err_t AsyncClient::_recv(tcp_pcb *pcb, pbuf *pb, err_t err) {
  while (pb != NULL) {
    _rx_last_packet = millis();
    // we should not ack before we assimilate the data
    _ack_pcb = true;
    pbuf *b = pb;
    pb = b->next;
    b->next = NULL;
    if (_pb_cb) {
      _pb_cb(_pb_cb_arg, this, b);
    } else {
      if (_recv_cb) {
        _recv_cb(_recv_cb_arg, this, b->payload, b->len);
      }
      if (!_ack_pcb) {
        _rx_ack_len += b->len;
      } else if (_pcb) {
        _tcp_recved(_pcb, _closed_slot, b->len);
      }
      pbuf_free(b);
    }
  }
  return ERR_OK;
}

err_t AsyncClient::_poll(tcp_pcb *pcb) {
  if (!_pcb) {
    // log_d("pcb is NULL");
    return ERR_OK;
  }
  if (pcb != _pcb) {
    log_d("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }

